package tasks

/*
Задача:

	Дан массив seats, где seats[i] = 1 значит что человек сидит на i-ом месте, seats[i] = 0 - не сидит.
	Есть по крайней мере одно свободное место и по крайней мере один сидящий человек.

	Алекс хочет сесть на такое место, чтобы расстояние между ним и ближайшим к нему человеком было максимальным

	Верните максимальное расстояние до ближайшего человека

Пример:

	Input: seats = [1,0,0,0,1,0,1]
	Output: 2

	Алексу нужно будет сесть на месте seats[2]
*/
func MaxDistToClosest(seats []int) int {
	l := 0
	dist := 0

	// если массив начинается с нуля, расстояние не нужно делить на 2
	for _, num := range seats {
		if num == 1 {
			break
		}
		dist++
	}

	for r := 1; r < len(seats); r++ {
		if seats[r] == 0 {
			// если последний элемент массива 0, расстояние не нужно делить на 2
			if r == len(seats) - 1 {
				dist = max(dist, r - l)
			}
			continue
		}

		if (r - l) % 2 == 1 {
			dist = max(dist, (r - l) / 2)
		} else {
			dist = max(dist, (r - l + 1) / 2)
		}
		l = r
	}

	return dist
}
